Revit 2027 API
ParameterTypeId.PathReinHookTypen2 Property
 "Alternating Bar - Start Hook Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PathReinHookTypen2 { get; }
Public Shared ReadOnly Property PathReinHookTypen2 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PathReinHookTypen2 {
	ForgeTypeId^ get ();
}
static member PathReinHookTypen2 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace